<template>
  <div class = 'help-center'>
    <div class = "special-banner"></div>
    <div class = "container">
      <el-row>
        <el-col :span = "6" class = "tabs-box">
          <div class = "tab-list">
            <div class = "tab"
                 @click = "toggleTab(i)"
                 v-for = "(item, i) in tabs"
                 :class = "{ active: activeTabIndex === i}">{{item}}
            </div>
          </div>
        </el-col>
        <el-col :span = "18">
          <div class = "content-box">
            <!-- 关于我们 -->
            <template v-if = "activeTabIndex === 0">
              <h5 class = "section-title"><strong>关于费查查</strong></h5>
              <p class = "margin-v-1x">
                费查查是马鞍山方融信息科技有限公司旗下的一款企业专利年费查询、监控产品，致力于为客户提供快速、准确、全面的专利年费数据服务等服务。
                通过多维度查询，多选项筛选，让查询结果更准确，查询内容更详尽！是专利代理机构、大中型企业相关人士的首选工具！</p>
              <h5 class = "section-title margin-t-2x"><strong>联系方式</strong></h5>
              <p class = "margin-v-1x"></p>
              <div class = "h4" style = "font-weight:normal;">马鞍山方融信息科技有限公司</div>
              <div class = "margin-v-0-3x">QQ：235566458</div>
              <div class = "margin-v-0-3x">邮箱：<a href = "#">citccld@163.com</a></div>
              <div class = "margin-v-0-3x">马鞍山市慈湖高新区霍里山大道北段1669号2栋</div>
            </template>
            <!-- 常见问题 -->
            <template v-if = "activeTabIndex === 1">
              <h5 class = "section-title"><strong>常见问题</strong></h5>
              <p><strong>Q1：费查查数据能及时更新吗？</strong><br>
                A：费查查是提供实时的专利法律状态相关信息数据查询，我们每周更新一次，保证数据为最新状态。<br><br><strong>Q2：注册登录后， 我可以享用哪些功能？</strong><br>
                A：注册登录后，您可以使用更多更强大的功能：<br> 1）可以查看更多专利案件数据条数；<br> 2）可按申请日、缴费截止日、案件类型、专利代理机构等条件进行精准筛选；<br>
                3）可以对需要关注专利案件进行监控；<br>
                4）可以进行通过邮箱方式对即将到期专利告警，以免失效。<br><br><strong>Q3：我查询一个专利信息怎么查询不到？</strong><br>
                A：没有找到想找的专利？您可以点击页面【在线咨询】按钮，小宝会为您进行深度搜索，并第一时间将查询结果通知到您，请您稍作等待。<br><br><strong>Q4：我想了解哪些企业申请或者持有某些专利？</strong><br>
                A：您只要输入专利号，比如20182021488655，或者申请人全称，即可找出该企业名下所有的专利信息。<br><br><strong>Q5：该款软件怎么收费的？</strong><br>
                1）您可以点击页面咨询，客户人员会给你收费详细标准 <br> 2）您可以在首页导航栏上点击“企业VIP”，查看详细信息<br>
                <br><strong>Q6:我发现了一个产品BUG，或者找不到想要的查询结果，或者有一个好的建议，应该向谁反馈？</strong><br>
                A：您可以直接联系费查查产品团队（QQ：235566458）,
                或者通过页面上的意见反馈对我们进行反馈，我们期待您的反馈和建议。<br><br>
                <strong>Q7：我想和费查查进行商务合作，应该向谁联系？</strong><br>
                A：您可以通过以下途径直接联系费查查产品团队：<br> 客服邮件：<a href = "#">citccld@163.com</a><br> 客服QQ：<a
                  href = "#">235566458</a><br> 客户经理Tel：<a href = "#">18900554231</a><br><br>
              </p>
            </template>
            <!-- 服务协议 -->
            <template v-if = "activeTabIndex === 2">
              <h5 class = "section-title"><strong>服务协议</strong></h5>
              <div class = "page-head">费查查服务协议</div>
              <p><strong>协议生效日期2018年10月1号</strong><br> <strong>欢迎您使用费查查！</strong><br>
                本协议是您与方融科技费查查（以下简称“本站”，网址为http://www.fee1688.com）所有者马鞍山方融信息科技有限公司（以下简称为"方融科技”或“本公司”）之间就费查查网站服务等相关事宜所订立的契约，请您仔细阅读本注册协议，您点击"同意协议并注册"按钮后，本协议即构成对双方具有约束力的法律文件。
                <br>
                <strong>一、总则：</strong>
                <br>
                1.1
                本站的各项电子服务的所有权和运作权归方融科技所有。用户同意本协议的条款并按照本站注册页面的提示完成全部注册程序，才能成为本站用户，用户点击同意本协议后，即视为用户确认本人具有享受本站服务相应的权利能力和行为能力，能够独立承担任何法律责任。如果您在18周岁以下，您只能在父母或监护人的监护下才能使用本站。
                <br>
                1.2 用户注册成功后，方融科技将给予每个用户一个帐号，该用户帐号由用户本人保管；用户应当对以其用户帐号进行的所有活动和事件承担法律责任。
                <br>
                1.3 用户一经注册本站帐号，用户有权通过该帐号享有本站各个频道的提供的单项服务，用户使用本站各单项服务时，用户的使用行为视为其对该单项服务的服务条款以及方融科技在该单项服务中发出的各类公告的同意。
                <br>
                1.4 费查查用户注册协议，方融科技可以随时更新，且无需另行通知。
                您在使用本站提供的各项服务之前，应仔细阅读本注册协议。如您不同意本注册协议及/或随时对其的修改，您可以主动取消本站提供的服务；您一旦使用本站服务，即视为您已了解并完全同意本服务协议各项内容，包括方融科技对服务协议随时所做的任何修改，并成为费查查用户。
                <br>
                <strong>二、费查查账户：</strong>
                <br>
                2.1 注册和账户
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;2.1.1
                在完成注册流程时，您应当按照中国法律法规要求，按相应页面的提示准确提供并及时更新您的资料，以使之真实、完整和准确。如本公司有合理理由怀疑您提供的资料错误、不实、过时或不完整的，马鞍山方融信息科技有限公司(以下简称“方融科技”)有权向您发出询问及/或要求改正的通知，并有权直接做出删除相应资料的处理，甚至中止、终止对您提供部分或全部服务。方融科技对此将不承担任何责任，您将承担因此产生的任何直接或间接损失及不利后果。
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;2.1.2
                您应当准确并及时更新您提供的电子邮件地址、姓名等联系方式，如您更换手机号码，请使用新手机号码重新注册新账户，以便与您进行有效联系，因通过这些联系方式无法与您取得联系，导致您在使用本服务过程中产生任何损失，应由您完全独自承担。您了解并同意，您有义务保持您提供的联系方式的有效性，如有变更需要更新的，您应按方融科技的要求进行操作。
                <br>
                2.2 账户安全

                您须对在您的账户下发生的所有活动承担责任。您同意：

                (a) 如发现任何人未经授权使用您的手机号登录本站，或发生违反保密规定的任何其他情况，您会立即通知方融科技，以保障您的合法权益；

                (b)确保您在每个上网时段结束时，以正确步骤离开网站。方融科技不能也不会对因您未能遵守本款规定而发生的任何损失或损毁及其他不利后果负责。您理解方融科技对您的请求采取行动需要合理时间，方融科技对在采取行动前已经产生的后果（包括但不限于您的任何损失）不承担任何责任。除非有法律规定或司法裁定，且征得方融科技的同意，否则，您的费查查账户不得以任何方式转让、赠与。
                <br>
                2.3 注销相关

                您理解并同意，如（a）您连续18个月未使用您的手机号或方融科技认可的其他方式登录过本站及其他方融科技网站或系统的；或（b）您在本站或者其他方融科技其他网站、系统中有侵犯他人合法权益或其他严重违反方融科技的网站和系统规则的行为的，方融科技有权注销您名下的账户，您将不能再登录方融科技的网站或系统，所有方融科技的服务将同时终止。方融科技有权将您违反前述约定的情形同步给其他网站。
                <br>
                <strong>三、本站服务使用守则</strong>
                <br>
                为有效保障您使用本服务的合法权益，您理解并同意接受以下规则：
                <br>
                3.1
                您在使用本服务过程中，本服务条款内容、页面上出现的关于设置提醒操作的提示或方融科技发送到您手机、邮箱的信息（短信、电话或邮件等）内容是您使用本服务的相关规则，您使用本服务即表示您同意接受本服务的相关规则。您了解并同意方融科技有权单方修改服务的相关规则，而无须征得您的同意，服务规则应以您使用服务时的页面提示（或发送到该手机的短信、邮件或电话等）为准，您同意并遵照服务规则是您使用本服务的前提。
                <br>
                3.2
                方融科技可能会以电子邮件（或发送到您手机的短信或电话等）方式通知您服务进展情况以及提示您进行下一步的操作，但方融科技不保证您能够收到或者及时收到该邮件（或发送到该手机的短信或电话等），且不对此承担任何后果。因此，在服务过程中您应当及时登录到本站查看和进行相关操作。因您没有及时查看和对服务状态进行修改或确认或未能提交相关申请而导致的任何纠纷或损失，方融科技不负任何责任。
                <br>
                3.3 您授权方融科技可以通过向第三方审核您的身份和资格，并取得您使用本服务的相关资料。
                <br>
                3.4
                服务费用：在您使用本服务时，方融科技有权依照相应的服务条款向您收取服务费用，方融科技在收取服务费用之前将征得您的同意。方融科技拥有制订及调整服务费之权利，具体服务费用以您使用本服务时页面上所列之收费方式公告或您与方融科技达成的其他书面服务条款为准。
                <br>
                3.5 本站上的商品价格、图片、详情等商品信息随时都有可能发生变动，本站不作特别通知。对此情形您知悉并理解。
                <br>
                <strong>四、方融科技的权利和义务</strong>
                <br>
                4.1 方融科技应根据您选择的服务以及交纳款项的情况向您提供相应的网络技术和信息服务。
                <br>
                4.2 方融科技承诺对您资料采取对外保密措施，不向第三方披露您的资料，不授权第三方使用您的资料，除非：
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.1 依据本服务条款或者您与方融科技之间其他服务条款、合同、在线条款等规定可以提供；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.2 依据法律法规的规定应当提供；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.3 行政、司法等职权部门要求方融科技提供；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.4 您同意方融科技向第三方提供；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.5 方融科技解决举报事件、提起诉讼而提交的；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.6 方融科技为防止严重违法行为或涉嫌犯罪行为发生而采取必要合理行动所必须提交的；
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;4.2.7 方融科技为向您提供产品、服务、信息而向第三方提供的，包括方融科技年费管家通过第三方的技术及服务向您提供产品、服务、信息的情况。
                <br>
                4.3 方融科技保留在您违反中国国家、地方法律法规规定或违反本服务条款的情况下终止为您提供服务并注销您账户的权利，并且在任何情况下，方融科技不对任何间接、偶然、特殊及继起的损害承担责任。
                <br>
                <strong>五、隐私及其他个人信息的保护</strong>
                <br>
                一旦您同意本服务条款或使用本服务，您即同意方融科技按照以下条款来使用和披露您的个人信息。

                5.1 登录手机号码和邮箱动态验证码
                <br>
                在您注册为方融科技用户时，我们会要求您设置登录手机号码来识别您的身份。您仅可通过您的手机号码以及对应的有效动态验证码来使用该账户，如果您泄漏了有效动态验证码，您可能会丢失您的个人识别信息，并可能导致对您不利的法律后果。该账户因任何原因受到潜在或现实危险时，您应该立即和方融科技取得联系，在方融科技采取行动前，方融科技对此不负任何责任。
                <br>
                5.2 用户信息
                <br>
                您完成账户注册流程时，为有针对性地向您提供新的服务和机会，请提供相应正确的个人信息。您了解并同意本公司及其关联公司或您使用的其他方融科技网站和系统将通过您的电子邮件地址或您提供的手机向您发送相关通知及其他信息。
                <br>
                5.3 登录记录
                <br>
                为了保障您使用本服务的安全以及不断改进服务质量，方融科技将记录并保存您登录和使用本服务的相关信息，但方融科技承诺不将此类信息提供给任何第三方（除双方另有约定或法律法规另有规定及方融科技关联公司外）。

                <br>
                5.4 安全
                <br>
                方融科技仅按现有技术提供相应的安全措施来使方融科技掌握的信息不丢失，不被滥用和变造。这些安全措施包括向其他服务器备份数据和对用户密码加密。尽管有这些安全措施，但方融科技不保证这些信息的绝对安全。

                <br>
                <strong>六、本站中断或故障</strong>
                <br>
                本站系统可能因下列状况无法正常运作，使您无法使用各项联网服务时，方融科技不承担损害赔偿责任，该状况包括但不限于：
                <br>
                6.1 方融科技在本站停机维护期间。
                <br>
                6.2 电信设备出现故障不能进行数据传输的。
                <br>
                6.3 因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成本站障碍不能执行业务的。
                <br>
                6.4 由于黑客攻击、电信部门技术调整或故障、网站升级问题等原因而造成本站的服务中断或者延迟。
                <br>
                <strong>七、责任范围及责任限制</strong>
                <br>
                7.1 本公司仅对本协议中列明的责任承担范围负责。
                <br>
                7.2 您明确因交易所产生的任何风险应由您与交易方承担。
                <br>
                7.3 方融科技年费管家用户信息是由用户本人自行提供的，本公司无法保证该信息之准确、及时和完整，您应对您的判断承担全部责任。
                <br>
                7.4 本公司不对交易标的及本服务提供任何形式的保证，包括但不限于以下事项：
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;7.4.1 本服务符合您的需求。
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;7.4.2 本服务不受干扰、及时提供或免于出错。
                <br>
                &nbsp;&nbsp;&nbsp;&nbsp;7.4.3 您经由本站购买或取得之任何产品、服务、资讯或其他资料符合您的期望。
                <br>
                7.5 本服务之合作单位，所提供之服务品质及内容由该合作单位自行负责。
                <br>
                7.6 您经由本服务之使用下载或取得任何资料，应由您自行考量并承担风险，因资料之下载而导致您电脑系统之任何损坏或资料流失，您应负完全责任。
                <br>
                7.7 您自本公司及本公司工作人员或经由本服务取得之建议和信息，无论其为书面或口头形式，均不构成本公司对本服务之保证。
                <br>
                7.8
                在法律允许的情况下，本公司对于与本协议有关或由本协议引起的任何间接的、惩罚性的、特殊的、派生的损失（包括业务损失、收益损失、利润损失、商誉损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除本公司对上述损失的责任。
                <br>
                7.9 除本协议另有规定外，在任何情况下，本公司对本协议所承担的违约赔偿责任总额不超过向您收取的当次服务费用总额。
                <br>
                7.10 您充分知晓并同意本公司可能同时为您及您的交易方提供本服务，您同意对本公司可能存在的该等行为予以明确豁免，并不得以此来主张本公司在提供本服务时存在法律上的瑕疵。
                <br>
                7.11 除本协议另有规定或本公司另行同意，您对本公司的委托及向本公司发出的指令均不可撤销。
                <br>
                <strong>八、商标、知识产权的保护</strong>
                <br>
                （一）
                本网站上所有内容，包括但不限于商标文字信息、图片、档案、分析数据、资料、网站架构、网站画面的安排、网页设计，均由本公司或本公司关联企业依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。
                <br>
                （二） 非经本公司或本公司关联企业书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表本网站程序或内容。
                <br>
                （三） 尊重知识产权是您应尽的义务，如有违反，您应承担损害赔偿责任。
                <br>
                <strong>九、法律适用与管辖</strong>
                <br>
                本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，没有相关法律规定的，参照通用国际商业惯例和（或）行业惯例。因本协议产生之争议，均应依照中华人民共和国法律予以处理，并以被告住所地人民法院为管辖法院。
                <br>
                我已阅读并同意以上协议内容。
                <br> <strong>您确认您已仔细阅读以上条款，同时完全接受以上条款的内容。</strong> <br><br></p>
            </template>
          </div>
        </el-col>
      </el-row>
    </div>
  </div>
</template>
<script>
  export default {
    data () {
      return {
        activeTabIndex : 0 ,
        tabs : [ '关于我们' , '常见问题' , '服务协议' ] ,
      }
    } ,

    mounted () {
      this.updateActiveIndex()
    } ,

    watch : {
      $route : function (to) {
        this.updateActiveIndex(to.query.section)
      } ,
    } ,

    methods : {
      toggleTab (i) {
        this.activeTabIndex = i
      } ,

      updateActiveIndex (val) {
        const section = val || this.$route.query.section || 0
        this.activeTabIndex = +section
        document.body.scrollTop = document.documentElement.scrollTop = 0
      } ,
    } ,
  }
</script>
<style scoped>
  .special-banner {
    height: 140px;
    width: 100%;
    background: url(../assets/images/hc_banner.png) no-repeat;
    background-size: cover;
    background-position: 50%;
    margin-bottom: 30px;
  }

  .container {
    width: 1200px;
    margin: 0 auto;
  }

  .tabs-box {
    border-radius: 4px;
    box-sizing: border-box;
  }

  .tab-list {
    margin-right: 15px;
    border: 1px solid #e0e3ec;
  }

  .tab {
    height: 60px;
    color: #43464f;
    font-size: 18px;
    cursor: pointer;
    line-height: 60px;
    padding-left: 25px;
    transition: color .3s;
  }

  .tab:not(:last-child) {
    border-bottom: 1px solid #e0e3ec;;
  }

  .tab:hover {
    background: #ebeef2;
  }

  .tab.active {
    color: #fff;
    background: #1478f0;
  }

  .content-box {
    margin-left: 15px;
  }

  strong {
    font-weight: 600;
  }

  .section-title {
    font-size: 16px;
    padding-left: 8px;
    margin-top: 10px;
    margin-bottom: 10px;
    border-left: 4px solid #1478f0;
  }

  .margin-v-1x {
    margin-top: 15px;
    margin-bottom: 15px;
  }

  .margin-t-2x {
    margin-top: 30px;
  }

  .margin-v-0-3x {
    margin-top: 5px;
    margin-bottom: 5px;
  }

  .h4 {
    font-size: 18px;
  }

  p {
    line-height: 25px;
  }

  a {
    color: #1478f0;
  }

  .page-head {
    font-size: 30px;
    color: #43464f;
    text-align: center;
    padding: 10px 0;
  }
</style>
